#!/usr/bin/env python3
# -*- coding: utf-8 -*-
#
# এই ফাইলটি execfile() দ্বারা চালানো হয় যেখানে বর্তমান ডিরেক্টরি সেট করা হয় এর
# containing ডিরেক্টরি হিসেবে।
#
# লক্ষ্য করুন যে, সমস্ত সম্ভব কনফিগারেশন মান এখানে উপস্থিত নেই,
# এই স্বয়ংক্রিয়ভাবে তৈরি হওয়া ফাইলে।
#
# সমস্ত কনফিগারেশন মানের একটি ডিফল্ট রয়েছে; যেগুলি মন্তব্য আকারে আছে
# তা ডিফল্ট মান দেখানোর জন্য।

# যদি এক্সটেনশনগুলি (অথবা যেসব মডিউল স্বয়ংক্রিয় ডকুমেন্টেশনের জন্য ব্যবহার করা হবে) অন্য কোনো ডিরেক্টরিতে থাকে,
# এই ডিরেক্টরিগুলি sys.path-এ যোগ করুন। যদি ডিরেক্টরি ডকুমেন্টেশনের মূল ডিরেক্টরির আপেক্ষিক হয়,
# os.path.abspath ব্যবহার করে এটি পূর্ণাঙ্গ করুন, যেমন এখানে দেখানো হয়েছে।
#
# import os
# import sys
# sys.path.insert(0, os.path.abspath('.'))


# -- সাধারণ কনফিগারেশন ------------------------------------------------

# যদি আপনার ডকুমেন্টেশন একটি ন্যূনতম Sphinx সংস্করণের প্রয়োজন হয়, এটি এখানে উল্লেখ করুন।
#
# needs_sphinx = '1.0'

# এখানে যেকোনো Sphinx এক্সটেনশন মডিউল নাম যোগ করুন, স্ট্রিং হিসেবে। এগুলি Sphinx দ্বারা আসা এক্সটেনশন হতে পারে
# (যেমন 'sphinx.ext.*') অথবা আপনার কাস্টম এক্সটেনশন।
extensions = []

# এখানে টেমপ্লেটগুলো ধারণ করে এমন যেকোনো পথ যোগ করুন, এই ডিরেক্টরির আপেক্ষিকভাবে।
templates_path = ['_templates']

# সোর্স ফাইলনামার সুফিক্স(es)।
# আপনি একাধিক সুফিক্স একটি স্ট্রিংয়ের তালিকা হিসেবে নির্ধারণ করতে পারেন:
#
# source_suffix = ['.rst', '.md']
source_suffix = '.rst'

# মাস্টার টোকট্রি ডকুমেন্ট।
master_doc = 'index'

# প্রকল্প সম্পর্কে সাধারণ তথ্য।
project = 'লিনাক্স মিন্ট অনুবাদ'
copyright = '২০২২, লিনাক্স মিন্ট'
author = 'Linux Mint ও খাত্তাব হাসান'

# প্রকল্পের সংস্করণ সম্পর্কিত তথ্য, যা |version| এবং |release| এর পরিবর্তে কাজ করে,
# এবং আরও বিভিন্ন স্থানে ব্যবহৃত হয়।
#
# সংক্ষিপ্ত X.Y সংস্করণ।
version = ''
# পূর্ণ সংস্করণ, যার মধ্যে alpha/beta/rc ট্যাগ রয়েছে।
release = ''

# Sphinx দ্বারা স্বয়ংক্রিয়ভাবে তৈরি কনটেন্টের ভাষা। সমর্থিত ভাষার তালিকার জন্য ডকুমেন্টেশন দেখুন।
#
# এটি সেই ক্ষেত্রেও ব্যবহৃত হয় যখন আপনি gettext ক্যাটালগের মাধ্যমে কনটেন্ট অনুবাদ করেন।
# সাধারণত আপনি কমান্ড লাইনে "language" সেট করেন এসব ক্ষেত্রে।
language = None

# সোর্স ফাইল খুঁজতে গিয়ে যে ফাইল এবং ডিরেক্টরি গুলি উপেক্ষা করতে হবে তাদের প্যাটার্নের তালিকা।
# এই প্যাটার্নগুলি html_static_path এবং html_extra_path এও প্রভাব ফেলবে।
exclude_patterns = ['_build', 'Thumbs.db', '.DS_Store']

# Pygments (সিনট্যাক্স হাইলাইটিং) শৈলীর নাম যা ব্যবহার করা হবে।
pygments_style = 'sphinx'

# যদি সত্যি হয়, তাহলে `todo` এবং `todoList` আউটপুট তৈরি করবে, নইলে তারা কিছুই তৈরি করবে না।
todo_include_todos = False


locale_dirs = ['../po']
gettext_compact = False

# -- HTML আউটপুটের জন্য অপশনগুলি ---------------------------------------

# HTML এবং HTML সাহায্য পৃষ্ঠাগুলির জন্য যে থিমটি ব্যবহার করা হবে।  বিল্ট-ইন থিমের তালিকার জন্য
# ডকুমেন্টেশন দেখুন।
#
html_theme = 'sphinx_rtd_theme'

# থিমের অপশনগুলি থিম-নির্দিষ্ট এবং থিমের চেহারা ও অনুভূতি কাস্টমাইজ করতে পারে
# আরও।  প্রতিটি থিমের জন্য উপলব্ধ অপশনগুলির জন্য ডকুমেন্টেশন দেখুন।
#
# html_theme_options = {}
#
html_favicon = 'favicon.ico'


# -- HTMLHelp আউটপুটের জন্য অপশনগুলি ------------------------------------

# HTML সাহায্য বিল্ডারের জন্য আউটপুট ফাইলের বেস নাম।
htmlhelp_basename = 'TranslationGuidedoc'


# -- LaTeX আউটপুটের জন্য অপশনগুলি ----------------------------------------

latex_elements = {
    # কাগজের আকার ('letterpaper' বা 'a4paper')।
    #
    # 'papersize': 'letterpaper',

    # ফন্টের আকার ('10pt', '11pt' বা '12pt')।
    #
    # 'pointsize': '10pt',

    # LaTeX পreamble এর জন্য অতিরিক্ত কনফিগারেশন।
    #
    # 'preamble': '',

    # LaTeX চিত্র (ফ্লোট) অ্যালাইমেন্ট।
    #
    # 'figure_align': 'htbp',
}

# LaTeX ফাইলে ডকুমেন্ট ট্রির গ্রুপিং। টাপলগুলোর তালিকা
# (সোর্স শুরু ফাইল, লক্ষ্য নাম, শিরোনাম,
#  লেখক, ডকুমেন্ট ক্লাস [howto, manual, অথবা নিজের ক্লাস])।
latex_documents = [
    (master_doc, 'TranslationGuide.tex', 'Translation Guide',
     'Linux Mint', 'manual'),
]


# -- ম্যানুয়াল পৃষ্ঠা আউটপুটের জন্য অপশনগুলি -----------------------------

# প্রতি ম্যানুয়াল পৃষ্ঠার জন্য একটি এন্ট্রি। টাপলগুলোর তালিকা
# (সোর্স শুরু ফাইল, নাম, বর্ণনা, লেখক, ম্যানুয়াল সেকশন)।
man_pages = [
    (master_doc, 'translationguide', 'Translation Guide',
     [author], 1)
]


# -- Texinfo আউটপুটের জন্য অপশনগুলি -------------------------------------

# Texinfo ফাইলে ডকুমেন্ট ট্রির গ্রুপিং। টাপলগুলোর তালিকা
# (সোর্স শুরু ফাইল, লক্ষ্য নাম, শিরোনাম, লেখক,
#  ডিরেক্টরি মেনু এন্ট্রি, বর্ণনা, ক্যাটেগরি)
texinfo_documents = [
    (master_doc, 'TranslationGuide', 'Translation Guide',
     author, 'translationguide', 'প্রকল্পের সংক্ষিপ্ত বর্ণনা',
     'Miscellaneous'),
]
